
export const Ayam =
{
    1: "ధ్వజయము",
    2: "ధూమయము",
    3: "సింహయము",
    4: "శ్వానాయము",
    5: "వృషభాయము",
    6: "ఖరాయము",
    7: "గజాయము",
    8: "శాకాయము"
}
export const goodAyam = [1, 3, 5, 7]

export const varalu =
{
    1: "ఆదివారం",
    2: "సోమవారం",
    3: "మంగళవారం",
    4: "మంగళవారం",
    5: "గురువారం",
    6: "శుక్రవారం",
    7: "శనివారం"
}
export const thidulu = {
    1: "శుక్లపక్షం పాడ్యమి",
    2: "శుక్లపక్షం విదియ",
    3: "శుక్లపక్షం తదియ",
    4: "శుక్లపక్షం చవితి",
    5: "శుక్లపక్షం పంచమి",
    6: "శుక్లపక్షం షష్ఠి",
    7: "శుక్లపక్షం సప్తమి",
    8: "శుక్లపక్షం అష్టమి",
    9: "శుక్లపక్షం నవమి",
    10: "శుక్లపక్షం దశమి",
    11: "శుక్లపక్షం ఏకాదశి",
    12: "శుక్లపక్షం ద్వాదశి",
    13: "శుక్లపక్షం త్రయోదశి",
    14: "శుక్లపక్షం చతుర్దశి",
    15: "శుక్లపక్షం పౌర్ణమి",
    16: "కృష్ణపక్షం పాడ్యమి",
    17: "కృష్ణపక్షంవిదియ",
    18: "కృష్ణపక్షం తదియ",
    19: "కృష్ణపక్షం చవితి",
    20: "కృష్ణపక్షం పంచమి",
    21: "కృష్ణపక్షం షష్ఠి",
    22: "కృష్ణపక్షం సప్తమి",
    23: "కృష్ణపక్షం అష్టమి",
    24: "కృష్ణపక్షం నవమి",
    25: "కృష్ణపక్షం దశమి",
    26: "కృష్ణపక్షం ఏకాదశి",
    27: "కృష్ణపక్షం ద్వాదశి",
    28: "కృష్ణపక్షం త్రయోదశి",
    29: "కృష్ణపక్షం చతుర్దశి",
    30: "కృష్ణపక్షం అమావాస్య"
}
export const nakshatralu = {
    1: "అశ్విని",
    2: "భరణి",
    3: "కృత్తికా",
    4: "రోహిణి",
    5: "మృగశిర్ష",
    6: "ఆర్ద్రా",
    7: "పునర్వసు",
    8: "పుష్య",
    9: "ఆశ్లేష",
    10: "మాఘ",
    11: "పూర్వ ఫాల్గుణి",
    12: "ఉత్తర ఫాల్గుణి",
    13: "హస్త",
    14: "చిత్ర",
    15: "స్వాతి",
    16: "విశాఖ",
    17: "అనురాధ",
    18: "జ్యేష్ట",
    19: "మూలా",
    20: "పూర్వ ఆషాఢ",
    21: "ఉత్తరాషాడ",
    22: "శ్రవణ",
    23: "ధనిష్ఠ",
    24: "శతభిష",
    25: "పూర్వాభాద్రపద",
    26: "ఉత్తర భాద్రపద",
    27: "రేవతి"
}
export const dhikpathulu = {
    1: "ఇంద్ర దిక్పతి - సౌఖ్యం",
    2: "అగ్ని దిక్పతి - గృహ దహనము",
    3: "యమా దిక్పతి - ధర్మ గుణము",
    4: "నైరుతి దిక్పతి - శత్రు భయము",
    5: "వరుణ దిక్పతి - పశు, ధన్య వృద్ధి",
    6: "వాయు దిక్పతి - చలన గుణము",
    7: "కుబేర దిక్పతి - ధన వృద్ధి",
    8: "ఈశాన్య దిక్పతి - అమంగళ కరము",
}
export const goodDhikpathulu = [1,3,5,7]

export const Amsha = {
    1: "నష్టంశ - ధన నష్టము",
    2: "వృద్ధింశ - అభివృద్ధి",
    3: "స్త్రీ అంశ - సౌభాగ్యం",
    4: "మృత్యంశ - రోగ భయము",
    5: "దహనంశ - అగ్నిభయము",
    6: "చోరంశ - చోర భయము",
    7: "పుత్రంశ - పుత్ర వృద్ధి",
    8: "గోధనంశ - పశు, ధన వృద్ధి",
    9: "కీర్తింశ - కీర్తి",
}
export const goodAmshas = [2, 3, 7, 8, 9]

export const Yogalu = {
    1: "విష్కంభము",
    2: "ప్రీతి",
    3: "ఆయుష్మాన్",
    4: "సౌభాగ్యము",
    5: "శోభనము",
    6: "అతిగండము",
    7: "సుకర్మము",
    8: "ధృతి",
    9: "శూలము",
    10: "గండము",
    11: "వృద్ధి",
    12: "ధ్రవము",
    13: "వ్యాఘాతము",
    14: "హర్షణము",
    15: "వజ్రము",
    16: "సిద్ధి",
    17: "వ్యతీపాతము",
    18: "పరియాన్",
    19: "పరిఘము",
    20: "శివము",
    21: "సిద్ధము",
    22: "సాధ్యము",
    23: "శుభము",
    24: "శుక్రము",
    25: "బ్రహ్మము",
    26: "ఐంద్రము",
    27: "వైదృతి",
}
export const goodYogha = [2, 3, 4, 5, 7, 8, 11, 12, 14, 16, 18, 20, 21, 22, 23, 24, 25, 26]

export const details = {
    "Dhanam":{
        "name": "ధనము",
        "multi": 8,
        "mod": 12
    },
    "Runam":{
        "name": "ఋణము",
        "multi": 3,
        "mod": 8
    },
    "Ayam":{
        "name": "ఆయము",
        "multi": 9,
        "mod": 8,
        "check":"true",
        "list": Ayam,
        "flag":"true",
        "glist": goodAyam
    },
    "Vayasu":{
        "name": "వయస్సు",
        "multi": 9,
        "mod": 120
    },
    "Varam":{
        "name": "వారము",
        "multi": 9,
        "mod": 7,
        "check":"true",
        "list": varalu
    },
    "Thidi":{
        "name": "తిథి",
        "multi": 6,
        "mod": 30,
        "check":"true",
        "list": thidulu
    },
    "Nakshatram":{
        "name": "నక్షత్రం",
        "multi": 8,
        "mod": 27,
        "check":"true",
        "list": nakshatralu
    },
    "Dikshusi":{
        "name": "దిక్పతి",
        "multi": 9,
        "mod": 8,
        "check":"true",
        "list": dhikpathulu,
        "flag":"true",
        "glist": goodDhikpathulu
    },
    "Amsha":{
        "name": "అంశ",
        "multi": 6,
        "mod": 9,
        "check":"true",
        "list": Amsha,
        "flag":"true",
        "glist": goodAmshas
    },
    "Yogam":{
        "name": "యోగం",
        "multi": 4,
        "mod": 27,
        "check":"true",
        "list":Yogalu,
        "flag":"true",
        "glist": goodYogha
    },
}
